Documents/Лицензия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Лицензия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОкончаниеЛицензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лицензия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаЛО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЛО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПарус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Лицензия/Ext/ManagerModule.bsl
Процедура Абонемент(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Абонемент)
	Макет = Документы.Лицензия.ПолучитьМакет("Абонемент");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛицПарус.ВариантРасчетаЛО,
	|	ЛицПарус.ВидНоменклатуры,
	|	ЛицПарус.Дата,
	|	ЛицПарус.ДатаДоговора,
	//|	ЛицПарус.ДоговорКонтрагента,
	|	ЛицПарус.ИсполнительДокумента,
	|	ЛицПарус.Комментарий,
	|	ЛицПарус.Контрагент,
	|	ЛицПарус.Лицензия,
	|	ЛицПарус.НеКонтролировать,
	|	ЛицПарус.Номер,
	|	ЛицПарус.НомерБланка,
	|	ЛицПарус.НомерДоговора,
	|	ЛицПарус.ОкончаниеЛицензии,
	|	ЛицПарус.Организация,
	|	ЛицПарус.Состав.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		ЛицПарус.Состав.Цена * 0.3 КАК ЦенаЛО,
	|		Сумма,
	|		ЛицПарус.Состав.Сумма * 0.3 КАК СуммаЛО,
	|		КоличествоПарус
	|	)
	|ИЗ
	|	Документ.Лицензия КАК ЛицПарус
	|ГДЕ
	|	ЛицПарус.Ссылка В(&СсылкаДок)";
	
	Запрос.Параметры.Вставить("СсылкаДок", Ссылка);
	
	
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставШапка 	= Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСостав 		= Макет.ПолучитьОбласть("Состав");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ПечСрокДействия = "с " + Формат(Выборка.Дата, "Д ДДММГГГГ") + " по " + Формат(Выборка.ОкончаниеЛицензии, "Д ДДММГГГГ");
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ИтСуммаЛО = 0;

		ТабДок.Вывести(ОбластьСоставШапка);
		ВыборкаСостав = Выборка.Состав.Выбрать();
		Пока ВыборкаСостав.Следующий() Цикл
			ОбластьСостав.Параметры.Заполнить(ВыборкаСостав);
			ТабДок.Вывести(ОбластьСостав, ВыборкаСостав.Уровень());
			
			ИтСуммаЛО = ИтСуммаЛО + ВыборкаСостав.СуммаЛО;
		КонецЦикла;

		ОбластьПодвал.Параметры.ИтСуммаЛО = ИтСуммаЛО;
		ТабДок.Вывести(ОбластьПодвал, ВыборкаСостав.Уровень());
		
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
